#+TITLE:Vally2012-RossRiverRates 
#+AUTHOR: Ivan Hanigan
#+email: ivan.hanigan@anu.edu.au
#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [a4paper]
#+LATEX: \tableofcontents
-----

** COMMENT test-newnode

#+begin_src R :session *R* :tangle no :exports none :eval yes
  projdir <- "~/projects/Vally2012-RossRiverRates"
  setwd(projdir)
  library(disentangle)
  library(stringr)
  steps <- read.csv(textConnection('
  STEP, INPUTS, OUTPUTS, DESCRIPTION
  Geocoding, private, shapefile, this was done by Mark Peel
  rates,     "shapefile, buffer", rates-ssheet, done by Mark 
  reshape long, rates-ssheet, "d_eastern, d_urban, dat2", dat2 is row binded to add urban and eastern to same table
  model1, "d_eastern, d_urban", "fit, fit1, fit1.1", Note that I decided to exclude zero pop from urban (fit1) and did this again as fit1.1 to show difference
  model2 , dat2, fit2, "This uses a multiplicative term, the variance-covariance matrix is required for B3 and SE"
  model3, dat2, fit3, This is the re-parametrisation so that coeff and se are easier
  '), stringsAsFactors = F, strip.white = T)
  ## #write.csv(steps, "workflow_steps.csv", row.names = F)
  ## steps <- read.csv("workflow_steps.csv", stringsAsFactors = F, strip.white = T)
  
  str(steps)
  nodes <- newnode(
    indat = steps,
    names_col = "STEP",
    in_col = "INPUTS",
    out_col = "OUTPUTS",
    desc_col = "DESCRIPTION",
    nchar_to_snip = 40)
  #DiagrammeR::grViz(nodes)
  
  sink("workflow_steps.dot")
  cat(nodes)
  sink()
  system("dot -Tpdf workflow_steps.dot -o workflow_steps.pdf")
  #browseURL("workflow_steps.pdf")
  
  
#+end_src

#+RESULTS:
: 0


